vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT798S_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT798S</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.09.00-pvw2" date="2025-08-12">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw2</release>
    <release version="25.09.00-pvw1" date="2025-07-14">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw1</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="20.0.0" date="2025-01-13">NXP CMSIS Packs based on MCUXpresso SDK 24.12.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT798S" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <description>i.MX RT700</description>
      <device Dname="MIMXRT798S">
        <processor Pname="cm33_core0" Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="325000000"/>
        <processor Pname="cm33_core1" Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="250000000"/>
        <environment Pname="cm33_core0" name="iar">
          <file category="linkerfile" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core0_ram.icf" condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id"/>
          <file category="linkerfile" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core1_ram.icf" condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT798S.condition_id"/>
        </environment>
        <environment Pname="cm33_core1" name="iar">
          <file category="linkerfile" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core0_ram.icf" condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id"/>
          <file category="linkerfile" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core1_ram.icf" condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT798S.condition_id"/>
        </environment>
        <sequences>
          <sequence name="EnableDebugMailbox">
            <block>__errorcontrol = 1;</block>
            <control if="!(ReadAP(0x0) &amp; 0x40)">
              <block>
                __dp = 0;
                __ap = 0;
                WriteDP(0, 0x0000001F); //Abort last read
                
                __errorcontrol = 0;
                
                __var status=0x55aa;
                Message(0, "RT7xx connect srcipt start");
                
                // Read APIDR
                __dp = 0;
                __ap = 2;
                status = ReadAP(0xFC);
                Message(0, "APIDR: 0x%08X", status);
                
                // Read DPIDR
                __dp = 0;
                __ap = 2;
                status = ReadDP(0x0);
                Message(0, "DPIDR: 0x%08X", status);
                
                // Active DebugMailbox
                __dp = 0;
                __ap = 2;
                WriteAP(0x0, 0x00000021);
                DAP_Delay(100000);
                __errorcontrol = 0x1;
                ReadAP(0x0);
                __errorcontrol = 0x0;
                
                // Enter Debug Session
                __dp = 0;
                __ap = 2;
                WriteAP(0x4, 0x00000007);
                DAP_Delay(100000);
                ReadAP(0x8);
                
                __dp = 0;
                __ap = 0;
                
                Message(0, "RT7xx connect srcipt end");
              </block>
            </control>
            <block>__errorcontrol = 0;</block>
          </sequence>
          <sequence name="enableCPU1">
            <block>
              Message(0, "RT7xx booting CPU1");
              //GlikeyWriteEnable(GLIKEY1, 9U)
              Write32(0x40220c00,0x00060000);//clear bit18
              Write32(0x40220c00,0x00020009);
              Write32(0x40220c00,0x00010009);
              Write32(0x40220c04,0x00290000);
              Write32(0x40220c00,0x00020009);
              Write32(0x40220c04,0x00280000);
              Write32(0x40220c00,0x00000009);
              //arbiter1: enable compute access ....
              Write32(0x40220f80,0x3fffffff);
              Write32(0x40220f84,0x3fffffff);
              
              Write32(0x40003030, 0x2); //SLEEPCON0-&gt;RUNCFG_CLR[1:] = 0
              
              Write32(0x00580000, 0x005C0000); //landing zone
              Write32(0x00580004, 0x00580009); //landing zone
              Write32(0x00580008, 0xE7FEE7FE); //landing zone
              
              //GlikeyClearConfig(GLIKEY4);
              Write32(0x40062c00, 0x00060000);
              
              Write32(0x40061040, 0x1); //CLKCTL3-&gt;PSCCTL0_COMP_SET = 0x1;
              Write32(0x40060070, 0x80000000); //RSTCTL3-&gt;PRSTCTL0_CLR
              
              Write32(0x4006208C, 0x0); //  SYSCON3-&gt;CPU_STATUS = 0
              Message(0, "RT7xx CPU1 booted");
            </block>
          </sequence>
          <sequence name="dpstart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              __var select = 0;
            </block>
            <control if="__ap==1">
              <block>select = 0x01000000;</block>
            </control>
            <block>
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, select);
              
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                  
                  Sequence("EnableDebugMailbox");
                </block>
              </control>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                  
                  Sequence("EnableDebugMailbox");
                </block>
              </control>
            </control>
          </sequence>
          <sequence name="DebugPortStart" Pname="cm33_core0">
            <block>
        __ap = 0;
        Sequence("dpstart");
      </block>
          </sequence>
          <sequence name="DebugPortStart" Pname="cm33_core1">
            <block>
              __ap = 0;
              Sequence("dpstart");
              Sequence("enableCPU1");
              __ap = 1;
              Sequence("dpstart");
            </block>
          </sequence>
          <sequence name="WaitForStopAfterReset" Pname="cm33_core0">
            <block>
              __var SCS_Addr    = 0xE000E000;
              __var DHCSR_Addr  = SCS_Addr + 0xDF0;
              __var DFSR_Addr  = SCS_Addr + 0xD30;
              Sequence("EnableDebugMailbox");
              Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
              // Clear watch point
              Write32(0xE0001020, 0x0);
              Write32(0xE0001028, 0x0);
              
              // Clear XPSR to avoid undefined instruction fault caused by IT/ICI
              Write32(0xE000EDF8, 0x01000000);
              Write32(0xE000EDF4, 0x00010010);
              // Set MSPLIM to 0
              Write32(0xE000EDF8, 0x00000000);
              Write32(0xE000EDF4, 0x0001001C);
            </block>
          </sequence>
          <sequence name="ResetHardware" Pname="cm33_core0">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;
              __var SCS_Addr    = 0xE000E000;
              __var DHCSR_Addr  = SCS_Addr + 0xDF0;
              
              // De-assert nRESET line
              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
            </block>
            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>
            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>
            <control if="!canReadPins">
              <block>
        // Assert nRESET line
        DAP_SWJ_Pins(nReset, nReset, 0);
      </block>
              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>
            <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
              <block>
                DAP_Delay(BootTime);  // Give bootloader time to do what it needs to do
                Sequence("WaitForStopAfterReset");
              </block>
            </control>
          </sequence>
          <sequence name="TraceStart" Pname="cm33_core0">
            <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
              <block>
                __var SWO_IOPCTL_ADDR = 0x4006400C;
                __var PSCCTL0_SET_ADDR = 0x40061040;
                __var PRSTCTL0_CLR_ADDR = 0x40060070;
                __var TPIUFCLKSEL_ADDR = 0x40001560;
                __var TPIUCLKDIV_ADDR = 0x40001564;
                __var TRACECLKEN_ADDR = 0x40001044; //CLKCTL0_PSCCTL1_SET
                __var divider = 0;
                
