vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="component.els_pkc.memory.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.param_integrity, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_param_integrity"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca.condition_id">
      <require condition="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.crc, component.els_pkc.oscca_aeadmodes, component.els_pkc.oscca_ciphermodes, component.els_pkc.oscca_macmodes, component.els_pkc.oscca_pkc, component.els_pkc.oscca_randommodes, component.els_pkc.oscca_safo, component.els_pkc.oscca_sm2, component.els_pkc.oscca_sm3, component.els_pkc.oscca_sm4, component.els_pkc.signature, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_crc"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_aeadmodes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_ciphermodes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_macmodes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_pkc"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_randommodes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_safo"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_sm2"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_sm3"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_oscca_sm4"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_aeadmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_ciphermodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_macmodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_pkc.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_randommodes.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_safo.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm2.condition_id">
      <require condition="allOf.component.els_pkc.common, component.els_pkc.signature, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.common, component.els_pkc.signature, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_common"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_signature"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm3.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.oscca_sm4.condition_id">
      <require condition="allOf.component.els_pkc.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.padding.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.param_integrity.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.pkc.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_ecc"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_math"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.platform.mimxrt.condition_id">
      <require condition="allOf.anyOf=device_id=MIMXRT798S, component.els_pkc.glikey, component.els_pkc.trng.type_els.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT798S, component.els_pkc.glikey, component.els_pkc.trng.type_els.internal_condition">
      <require condition="anyOf.device_id=MIMXRT798S.internal_condition"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_glikey"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_trng_type_els"/>
    </condition>
    <condition id="component.els_pkc.pre_processor.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.prng.condition_id">
      <require condition="allOf.component.els_pkc.ecc, component.els_pkc.math, component.els_pkc.rsa, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.psa_driver.condition_id">
      <require condition="allOf.component.els_pkc, component.els_pkc.buffer, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc, component.els_pkc.buffer, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_main"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_buffer"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.prng, component.els_pkc.random_modes, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.prng, component.els_pkc.random_modes, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_prng"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_random_modes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT798S.internal_condition"/>
    </condition>
