vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="allOf.component.els_pkc.aes, component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_aes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes_ctr.condition_id">
      <require condition="allOf.component.els_pkc.aes, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aes, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.trng, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_aes"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.random_modes_hmacdrbg.condition_id">
      <require condition="allOf.component.els_pkc.random_modes, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.random_modes, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_random_modes"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.rsa.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.rsa_oaep.condition_id">
      <require condition="allOf.component.els_pkc.rsa, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.rsa, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_rsa"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.secure_counter.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.session.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.random, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_random"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.signature.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, component.els_pkc.toolchain, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.standalone_gdet.condition_id">
      <require condition="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els_header_only, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_els_header_only"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.static_lib.mimxrt.condition_id">
      <require condition="allOf.anyOf=device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.toolchain.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
