vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="component.els_pkc.trng.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_els.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.trng, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.trng, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.trng.type_rng4.condition_id">
      <require condition="allOf.component.els_pkc.trng, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.trng, device=MIMXRT798S.internal_condition">
      <require Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_trng"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_xspi.condition_id">
      <require condition="allOf.driver.xspi, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.xspi, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xspi"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=device_id=MIMXRT798S, driver.gpio.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT798S, driver.gpio.internal_condition">
      <require condition="anyOf.device_id=MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition">
      <accept condition="allOf.anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter.internal_condition"/>
      <accept condition="allOf.component.i3c_adapter, driver.i3c.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpi2c, component.lpi2c_adapter.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_adapter"/>
    </condition>
    <condition id="anyOf.driver.lpflexcomm_lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
    </condition>
    <condition id="allOf.component.i3c_adapter, driver.i3c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.i3c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus.condition_id">
      <require condition="allOf.component.lists, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
