vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="allOf.anyOf=driver.cache_xcache, driver.romapi, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.cache_xcache, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_xcache, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.anyOf=driver.common, driver.crc, component.lists, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.common, driver.crc, component.lists, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.common, driver.crc.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.common, driver.crc.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition">
      <accept condition="allOf.component.trng_adapter, driver.trng.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="allOf.component.trng_adapter, driver.trng.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
