vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="allOf.utility.debug_console_lite, utility.assert_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
    </condition>
    <condition id="anyOf.allOf=driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0, allOf=driver.power, core_id=cm33_core1.internal_condition">
      <accept condition="allOf.driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0.internal_condition"/>
      <accept condition="allOf.driver.power, core_id=cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.driver.xspi, driver.cache_xcache, driver.power, core_id=cm33_core0.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="core_id.cm33_core0.internal_condition"/>
    </condition>
    <condition id="core_id.cm33_core0.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
    </condition>
    <condition id="allOf.driver.power, core_id=cm33_core1.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="core_id.cm33_core1.internal_condition"/>
    </condition>
    <condition id="core_id.cm33_core1.internal_condition">
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT798S_system"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, iar, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="IAR"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT798S_header"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cache_xcache.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov5640.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7670.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT798S.internal_condition"/>
    </condition>
