vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MIMXRT798S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpi2c, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpi2c, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MIMXRT798S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpspi, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpspi, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT798S, device.RTE, device_id=MIMXRT798S, driver.lpflexcomm_lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpuart, device_id=MIMXRT798S.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpuart, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpuart, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
