vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-hx8394.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-mipi-dsi-cmd.condition_id">
      <require condition="allOf.anyOf=driver.mipi_dsi, driver.common, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.mipi_dsi, driver.common, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.mipi_dsi.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.mipi_dsi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mipi_dsi"/>
    </condition>
    <condition id="driver.display-rm67162.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm67191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68191.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm68200.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-rm692c9.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.display-rpi.condition_id">
      <require condition="allOf.driver.display-common, driver.display-mipi-dsi-cmd, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.dsp.condition_id">
      <require condition="allOf.driver.power, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.power, device=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.ezhv.condition_id">
      <require condition="allOf.core_id=cm33_core0, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.core_id=cm33_core0, device_id=MIMXRT798S.internal_condition">
      <require condition="core_id.cm33_core0.internal_condition"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_i2s, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_i2s, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma4.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_mculcd, driver.edma4, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_mculcd, driver.edma4, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_spi, driver.edma4, device=MIMXRT798S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_spi, driver.edma4, device=MIMXRT798S.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MIMXRT798S.internal_condition"/>
    </condition>
