vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
        <file category="other" name="components/els_pkc/doc/mimxrt/html/navtreeindex8.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/navtreeindex9.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/open.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/pages.html" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/resize.js" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/splitbar.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/splitbard.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/sync_off.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/sync_on.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_a.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_ad.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_b.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_bd.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_h.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_hd.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_s.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="image" name="components/els_pkc/doc/mimxrt/html/tab_sd.png" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/tabs.css" projectpath="component/els_pkc/doc/mimxrt/html"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_10.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_11.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_12.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_13.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_14.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_15.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_2.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_3.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_4.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_5.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_6.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_7.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_8.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_9.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_a.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_b.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_c.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_d.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_e.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/all_f.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/classes_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/close.svg" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/defines_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/defines_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/defines_2.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/defines_3.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/files_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/functions_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/functions_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_2.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_3.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_4.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_5.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_6.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_7.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_8.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_9.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_a.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_b.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_c.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/groups_d.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/mag.svg" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/mag_d.svg" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/mag_sel.svg" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/mag_seld.svg" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/pages_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/pages_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="doc" name="components/els_pkc/doc/mimxrt/html/search/search.css" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/search.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/searchdata.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/typedefs_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_0.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_1.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_10.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_11.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_12.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_13.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_14.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_15.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_2.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_3.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_4.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_5.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_6.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_7.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_8.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_9.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_a.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_b.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_c.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_d.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_e.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="other" name="components/els_pkc/doc/mimxrt/html/search/variables_f.js" projectpath="component/els_pkc/doc/mimxrt/html/search"/>
        <file category="doc" name="components/els_pkc/LICENSE.txt" projectpath="component/els_pkc"/>
        <file category="doc" name="components/els_pkc/softwareContentRegister.txt" projectpath="component/els_pkc"/>
        <file category="doc" name="components/els_pkc/ReleaseNotes.txt" projectpath="component/els_pkc"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
