vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="MIMXRT798S els_pkc" Cgroup="els_pkc_math" Cversion="1.9.0" condition="component.els_pkc.math.condition_id">
      <description>Component els_pkc.math</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivide.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModExp_SqrMultL2R.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_ReduceModEven.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMath/src/mcuxClMath_Utils.c" projectpath="component/els_pkc/src/comps/mcuxClMath/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ModInv_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_NDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_QDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_SecModExp_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/mcuxClMath_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ExactDivideOdd.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ModInv.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_NDash.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_QDash.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_SecModExp.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_Utils.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ModInv_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_NDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_QDash_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_SecModExp_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMath/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMath/inc/internal/"/>
      </files>
    </component>
