vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_frdm_rw61x" Cversion="1.0.0" condition="component.wifi_bt_module.board_frdm_rw61x.condition_id">
      <description>FRDM-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_FRDM_RW61X
#define WIFI_BOARD_FRDM_RW61X 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_frdm_rw61x_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_k32w061_trnscver" Cversion="1.0.0" condition="component.wifi_bt_module.board_k32w061_transceiver.condition_id">
      <description>IK32W061-TRANSCEIVER Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_k32w061_transceiver_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1xk_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1xk_m2.condition_id">
      <description>IW416-MURATA-1XK-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_MURATA_1XK_M2
        #define WIFI_IW416_BOARD_MURATA_1XK_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1xk_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1xk_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1xk_usd.condition_id">
      <description>IW416-MURATA-1XK-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_MURATA_1XK_USD
        #define WIFI_IW416_BOARD_MURATA_1XK_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1xk_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1zm_m2.condition_id">
      <description>MURATA-1ZM-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_MURATA_1ZM_M2
        #define WIFI_88W8987_BOARD_MURATA_1ZM_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1zm_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_1zm_usd.condition_id">
      <description>MURATA-1ZM-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_MURATA_1ZM_USD
        #define WIFI_88W8987_BOARD_MURATA_1ZM_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_1zm_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2dl_m2.condition_id">
      <description>IW611-MURATA-2DL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW611_BOARD_MURATA_2DL_M2
        #define WIFI_IW611_BOARD_MURATA_2DL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2dl_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2dl_usd.condition_id">
      <description>IW611-MURATA-2DL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW611_BOARD_MURATA_2DL_USD
        #define WIFI_IW611_BOARD_MURATA_2DL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2dl_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ds_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ds_m2.condition_id">
      <description>MURATA-2DS-M2 Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ds_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ds_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ds_usd.condition_id">
      <description>MURATA-2DS-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ds_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2el_m2.condition_id">
      <description>IW612-MURATA-2EL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW612_BOARD_MURATA_2EL_M2
        #define WIFI_IW612_BOARD_MURATA_2EL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2el_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2el_usd.condition_id">
      <description>IW612-MURATA-2EL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW612_BOARD_MURATA_2EL_USD
        #define WIFI_IW612_BOARD_MURATA_2EL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2el_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ll_m2.condition_id">
      <description>IW610-MURATA-2LL-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW610_BOARD_MURATA_2LL_M2
        #define WIFI_IW610_BOARD_MURATA_2LL_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ll_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_murata_2ll_usd.condition_id">
      <description>IW610-MURATA-2LL-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW610_BOARD_MURATA_2LL_USD
        #define WIFI_IW610_BOARD_MURATA_2LL_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_murata_2ll_usd_dummy.txt"/>
      </files>
    </component>
