vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT798S_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT798S_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/arm/MIMXRT798Sxxxx_cm33_core0_ram.scf" version="1.0.0" projectpath="MIMXRT798S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/arm/MIMXRT798Sxxxx_cm33_core0_flash.scf" version="1.0.0" projectpath="MIMXRT798S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/arm/MIMXRT798Sxxxx_cm33_core0_flash1.scf" version="1.0.0" projectpath="MIMXRT798S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/gcc/MIMXRT798Sxxxx_cm33_core0_ram.ld" version="1.0.0" projectpath="MIMXRT798S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/gcc/MIMXRT798Sxxxx_cm33_core0_flash.ld" version="1.0.0" projectpath="MIMXRT798S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/gcc/MIMXRT798Sxxxx_cm33_core0_flash1.ld" version="1.0.0" projectpath="MIMXRT798S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core0_ram.icf" version="1.0.0" projectpath="MIMXRT798S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core0_flash.icf" version="1.0.0" projectpath="MIMXRT798S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core0_flash1.icf" version="1.0.0" projectpath="MIMXRT798S/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/arm/MIMXRT798Sxxxx_cm33_core1_ram.scf" version="1.0.0" projectpath="MIMXRT798S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/gcc/MIMXRT798Sxxxx_cm33_core1_ram.ld" version="1.0.0" projectpath="MIMXRT798S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MIMXRT798S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT798S/iar/MIMXRT798Sxxxx_cm33_core1_ram.icf" version="1.0.0" projectpath="MIMXRT798S/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT798S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT798S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT798S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/clock_config.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/clock_config.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/clock_config.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/clock_config.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/pin_mux.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/pin_mux.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/pin_mux.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/pin_mux.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/peripherals.h" version="1.0.0" projectpath="board/cm33_core0" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core0/peripherals.c" version="1.0.0" projectpath="board/cm33_core0"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/peripherals.h" version="1.0.0" projectpath="board/cm33_core1" path="devices/MIMXRT798S/project_template"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/project_template/cm33_core1/peripherals.c" version="1.0.0" projectpath="board/cm33_core1"/>
        <file category="include" name="devices/MIMXRT798S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT798S_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core0.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/startup_MIMXRT798S_cm33_core0.c" version="1.0.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, iar, mdk, core_ids=cm33_core1.condition_id" category="sourceC" attr="config" name="devices/MIMXRT798S/startup_MIMXRT798S_cm33_core1.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
