vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-hx8394" Cversion="1.0.0" condition="driver.display-hx8394.condition_id">
      <description>Driver display-hx8394</description>
      <files>
        <file category="header" name="components/video/display/hx8394/fsl_hx8394.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/hx8394/fsl_hx8394.c" projectpath="video"/>
        <file category="include" name="components/video/display/hx8394/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd" Cversion="1.0.2" condition="driver.display-mipi-dsi-cmd.condition_id">
      <description>Driver display-mipi-dsi-cmd</description>
      <files>
        <file category="header" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.c" projectpath="video"/>
        <file category="include" name="components/video/display/mipi_dsi_cmd/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67162" Cversion="1.0.2" condition="driver.display-rm67162.condition_id">
      <description>Driver display-rm67162</description>
      <files>
        <file category="header" name="components/video/display/rm67162/fsl_rm67162.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67162/fsl_rm67162.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67162/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67191" Cversion="1.1.0" condition="driver.display-rm67191.condition_id">
      <description>Driver display-rm67191</description>
      <files>
        <file category="header" name="components/video/display/rm67191/fsl_rm67191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67191/fsl_rm67191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68191" Cversion="1.1.0" condition="driver.display-rm68191.condition_id">
      <description>Driver display-rm68191</description>
      <files>
        <file category="header" name="components/video/display/rm68191/fsl_rm68191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68191/fsl_rm68191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68200" Cversion="1.1.1" condition="driver.display-rm68200.condition_id">
      <description>Driver display-rm68200</description>
      <files>
        <file category="header" name="components/video/display/rm68200/fsl_rm68200.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68200/fsl_rm68200.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68200/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm692c9" Cversion="1.1.0" condition="driver.display-rm692c9.condition_id">
      <description>Driver display-rm692c9</description>
      <files>
        <file category="header" name="components/video/display/rm692c9/fsl_rm692c9.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm692c9/fsl_rm692c9.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm692c9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rpi" Cversion="1.0.0" condition="driver.display-rpi.condition_id">
      <description>Driver display-rpi</description>
      <files>
        <file category="header" name="components/video/display/rpi/fsl_rpi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rpi/fsl_rpi.c" projectpath="video"/>
        <file category="include" name="components/video/display/rpi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dsp" Cversion="2.0.0" condition="driver.dsp.condition_id">
      <description>DSP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_dsp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_dsp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.10.6" condition="driver.edma4.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_edma_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc" Cversion="1.0.0" condition="driver.edma_soc.condition_id">
      <description>EDMA SOC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_edma_soc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_edma_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
