vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pngdec" Cversion="2.0.1" condition="driver.pngdec.condition_id">
      <description>PNGDEC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_pngdec.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_pngdec.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.4.2" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_power.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_power.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUFv3" Cversion="2.0.3" condition="driver.puf_v3.condition_id">
      <description>PUFv3 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_puf_v3.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_puf_v3.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pvts" Cversion="2.0.2" condition="driver.pvts.condition_id">
      <description>PVTS driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_pvts.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_pvts.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.1.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.1.0" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/romapi/bootloader/fsl_romapi.h" projectpath="drivers/romapi/bootloader"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/romapi/bootloader/fsl_romapi.c" projectpath="drivers/romapi/bootloader"/>
        <file category="header" name="devices/MIMXRT798S/drivers/romapi/otp/fsl_romapi_otp.h" projectpath="drivers/romapi/otp"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/romapi/otp/fsl_romapi_otp.c" projectpath="drivers/romapi/otp"/>
        <file category="header" name="devices/MIMXRT798S/drivers/romapi/nboot/fsl_romapi_nboot.h" projectpath="drivers/romapi/nboot"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/romapi/nboot/fsl_romapi_nboot.c" projectpath="drivers/romapi/nboot"/>
        <file category="header" name="devices/MIMXRT798S/drivers/romapi/iap/fsl_romapi_iap.h" projectpath="drivers/romapi/iap"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/romapi/iap/fsl_romapi_iap.c" projectpath="drivers/romapi/iap"/>
        <file category="header" name="devices/MIMXRT798S/drivers/romapi/iap/fsl_sbloader_v3.h" projectpath="drivers/romapi/iap"/>
        <file category="include" name="devices/MIMXRT798S/drivers/romapi/"/>
        <file category="include" name="devices/MIMXRT798S/drivers/romapi/bootloader/"/>
        <file category="include" name="devices/MIMXRT798S/drivers/romapi/nboot/"/>
        <file category="include" name="devices/MIMXRT798S/drivers/romapi/iap/"/>
        <file category="include" name="devices/MIMXRT798S/drivers/romapi/otp/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.3" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
