vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT798S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_hal" Cversion="2.1.0" condition="driver.tfa9xxx_hal.condition_id">
      <description>Driver tfa9xxx_hal</description>
      <files>
        <file category="header" name="components/codec/tfa9xxx/tfa_device_hal.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/tfa_device_hal.c" projectpath="codec/tfa9xxx"/>
        <file category="include" name="components/codec/tfa9xxx/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tma525b" Cversion="1.0.0" condition="driver.tma525b.condition_id">
      <description>Driver tma525b</description>
      <files>
        <file category="header" name="components/touch/tma525b/fsl_tma525b.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/tma525b/fsl_tma525b.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/tma525b/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng" Cversion="2.0.19" condition="driver.trng.condition_id">
      <description>TRNG Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_trng.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_trng.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdhc" Cversion="2.8.6" condition="driver.usdhc.condition_id">
      <description>USDHC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_usdhc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_usdhc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="utick" Cversion="2.0.5" condition="driver.utick.condition_id">
      <description>UTICK Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_utick.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_utick.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-common" Cversion="1.1.0" condition="driver.video-common.condition_id">
      <description>Driver video-common</description>
      <files>
        <file category="header" name="components/video/fsl_video_common.h" projectpath="video"/>
        <file category="sourceC" name="components/video/fsl_video_common.c" projectpath="video"/>
        <file category="include" name="components/video/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524" Cversion="2.1.1" condition="driver.wm8524.condition_id">
      <description>Driver wm8524</description>
      <RTE_Components_h>
#ifndef CODEC_WM8524_ENABLE
#define CODEC_WM8524_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8524/fsl_wm8524.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8524/fsl_wm8524.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8524/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962" Cversion="2.2.0" condition="driver.wm8962.condition_id">
      <description>Driver wm8962</description>
      <RTE_Components_h>
#ifndef CODEC_WM8962_ENABLE
#define CODEC_WM8962_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8962/fsl_wm8962.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8962/fsl_wm8962.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8962/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.10" condition="driver.wwdt.condition_id">
      <description>WWDT Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT798S/drivers/fsl_wwdt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT798S/drivers/fsl_wwdt.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT798S/drivers/"/>
      </files>
    </component>
